#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//int main()
//{
//	int a = 0;
//	//~ 内存里的二进制按位取反
//	//正数的原=反=补
//	//内存中是补码，补码等于反码加一
//	//原码符号位不变，其余各个位取反得到反码
//	//打印的值是原码
//	printf("%d\n", ~a);
//	return 0;
//}

//int main()
//{
//	int a = 13;
//	//000000000000000000001101原来的
//	//000000000000000000000001想得到
//	//a | (1 << 1);操作
//	//000000000000000000001111原来的
//	//111111111111111111111101目标
//	//000000000000000000000001
//	//a&(~(1<<1));操作
//	return 0;
//}

//scanf()  -EOF  -->-1
//~-1==0

//int main()
//{
//	int a = 0;
//	int b = 0;
//	while (~scanf("%d", &a))
//	{
//
//	}
//	return 0;
//}妙啊

int main()
{
	//++ --前置和后置
	int a = 10;
	int b = a++;
	printf("%d %d", a, b);
	return 0;
}

//int main()
//{
//
//	return 0;
//}